<template>
  <div id="Main">
    <div class="header">
        <h3>最终幻想XIV中文维基</h3>
        <svg data-v-c1125c94="" width="48" height="48" viewBox="0 0 24 24" fill="none" data-v-49e1d93c=""><path data-v-c1125c94="" fill="#adadad" fill-rule="evenodd" clip-rule="evenodd" d="M15.4615 10.6154C15.4615 9.28124 14.9874 8.14003 14.0391 7.19171C13.0907 6.24338 11.9495 5.76923 10.6154 5.76923C9.28124 5.76923 8.14003 6.24338 7.19171 7.19171C6.24338 8.14003 5.76923 9.28124 5.76923 10.6154C5.76923 11.9495 6.24338 13.0907 7.19171 14.0391C8.14003 14.9874 9.28124 15.4615 10.6154 15.4615C11.9495 15.4615 13.0907 14.9874 14.0391 14.0391C14.9874 13.0907 15.4615 11.9495 15.4615 10.6154ZM21 19.6154C21 19.9904 20.863 20.3149 20.5889 20.5889C20.3149 20.863 19.9904 21 19.6154 21C19.226 21 18.9014 20.863 18.6418 20.5889L14.9315 16.8894C13.6406 17.7837 12.2019 18.2308 10.6154 18.2308C9.58413 18.2308 8.59796 18.0307 7.65685 17.6304C6.71574 17.2302 5.90445 16.6893 5.22296 16.0078C4.54146 15.3263 4.0006 14.515 3.60036 13.5739C3.20012 12.6328 3 11.6466 3 10.6154C3 9.58413 3.20012 8.59796 3.60036 7.65685C4.0006 6.71574 4.54146 5.90445 5.22296 5.22296C5.90445 4.54146 6.71574 4.0006 7.65685 3.60036C8.59796 3.20012 9.58413 3 10.6154 3C11.6466 3 12.6328 3.20012 13.5739 3.60036C14.515 4.0006 15.3263 4.54146 16.0078 5.22296C16.6893 5.90445 17.2302 6.71574 17.6304 7.65685C18.0307 8.59796 18.2308 9.58413 18.2308 10.6154C18.2308 12.2019 17.7837 13.6406 16.8894 14.9315L20.5998 18.6418C20.8666 18.9087 21 19.2332 21 19.6154Z" data-v-49e1d93c=""></path></svg>
    </div>
    <div style="height:140px"></div>
    <div class="card">
        最终幻想XIV中文维基正在建设中，我们需要你的帮助！编辑入门戳→维基新手教程
        <br>现有25K位关注者，1,152,474次编辑，5,515篇文章和194,718张图片。
    </div>
    <el-carousel trigger="click" height="150px">
      <el-carousel-item>
        <img src="~@/assets/img/4.png" style="object-fit:cover;height: 150px;">
      </el-carousel-item>
      <el-carousel-item>
        <img src="~@/assets/img/5.png" style="object-fit:cover;height: 150px;">
      </el-carousel-item>
      <el-carousel-item>
        <img src="~@/assets/img/6.png" style="object-fit:cover;height: 150px;">
      </el-carousel-item>
    </el-carousel>
    <div class="card">
        - 83个页面需要你的帮助。<br>
        - 5个页面亟待翻译。<br>
        - 18个页面正在施工。<br>
        - 7个页面需要长期更新。<br>
        - 正在建设 <br>

        艾欧泽亚的生物绝赞填坑中！<br>
        NPC信息补完进行中... <br>
        艾欧泽亚地理补完进行中... <br>
        在艾欧泽亚体验过的音乐正在被收录... <br>
    </div>
    <div class="card"  style="font-size:9px;">
职业/特职的等级上限提升为90级<br>
神典石迭代（经典 · 奇谭默示停产停用，可兑换为诗学 · 幻想删除）<br>
追加全新特职「钐镰客」「贤者」（无基础职业，初始等级70级）<br>
追加全新怪物 · 追加全新恶名精英 ·追加6.0区域的怪物狩猎追加现有的职业的全新技能<br>
技能与特性进行了调整（6.08版本为止的技能/特性修改）<br>
提前实装了6.01的迷宫挑战和狩猎经验值提升<br>
延长各类技能的连击可响应时间<br>
使用极限技时将不会中断连击<br>
治疗职能的极限技的效果范围从30m 扩大为 50m<br>
部分特职的专用资源将直接积蓄到最大值 · 无法战斗时部分职业/特职的专用资源将不会被重置<br>
未满80级时的兵装转换奖励从1.5倍上调为2倍<br>
追加了90级的木人歼灭战<br>
在迷宫挑战中，路上的怪物不再提供经验值奖励，而是将会和讨伐头目时的奖励经验一起发放<br>
战斗状态参数变更：<br>
武器的物理伤害值将提升至同一品级下的武器的魔法伤害相同的值<br>
提升了「信念」状态参数对伤害的影响<br>
低等级的部分装备状态参数中，「信念」、「信仰」的数值将提升至和「暴击」、「直击」同等数值<br>
变更了部分敌人与NPC的技能效果<br>
状态「潜能」的名称变更为「不屈的斗志」，同时更改了文本说明<br>
随着等级上限的开放，新服/优待服奖励等级上限变更为79级<br>
幻巧战将暂时关闭<br>
在火龙狩猎战和火龙上位狩猎战中追加成功破坏火龙的尾巴时的切断表现<br>
钻石神兵加入超越之力 · 伊甸零式再生之章超越之力强化<br>
「希望之炮台：“塔”」的通关奖励「惰性星形晶簇」的每周获取上限解除<br>
深层迷宫追加钐镰客和贤者武器<br>
任务搜索器进行整理和优化 · 随机任务随版本更新<br>
「禁地优雷卡」、「南方博兹雅战线／扎杜诺尔高原」、「女王古殿」中，玩家名单的排序方式追加「按职业排序」<br>
「帝国湖岸堡攻城战」、「旗舰达尔里阿达号攻略战」中，使用「返回」时的提示文本进行了调整<br>
女王古殿最多发送申请后等待10分钟即可进入，不满24人将附加超越之力<br>
搭档的经验值计算方法进行了变更<br>
    </div>
  </div>
</template>

<script>


export default {
    data(){return {

    }}
}
</script>

<style lang="scss" scoped>
#Main{

    background-color: #333333;
    height: 100%;
}

.header {
    position: fixed;
    top:60px;
    left: 0px;
    right: 0px;

    z-index: 3;

    display: flex;
    flex-direction: row;
    flex-wrap: nowrap;
    justify-content: space-around;
    align-items: center;
    align-content: center;
    color:white;
    background-color: #3b3b3b;

}

.card {
    background-color:#292929;
    border: solid 1px rgba(189,164,91,0.6);
    border-radius: 5px;
    box-shadow: rgb(0 0 0 / 50%) 0px 1px 3px;
    margin: 10px;
    padding: 10px;

    color:white;
    font-size:15px;
}
</style>